import math


def area(r):
    '''эта функция принимает r, возвращает значение площади круга с радиусом r
    параметры: 
    (int) r:     радиус круга
    возвращаемое значение: площадь круга 
    пример вызова
    >>>area(3)
    28,274333882219     
    '''
    return math.pi * r * r


def perimeter(r):
    '''это функция принимает r, возвращает значение длины окружности с радиусом r 
     параметры: 
    (int) r:     радиус круга
    возвращаемое значение: перметр круга
    пример вызова
    >>>perimetr(3)
    18,8495559214793
    '''
    return 2 * math.pi * r

