def area(a,b):
    '''эта функция принимает a,b возвращает значение площади прямоугольникка со сторонами a и b
    параметры: 
    (float) a:  ширина прямоугольника 
    (float) b: длина прямоугольника
    возвращаемое значение: площадь прямоугольника
    пример вызова
    >>>area(3,4)
    12
    '''
    return(a*b)


def perimetr(a,b):
    '''эта функция принимает a,b возвращает значение периметра прямоугольникка со сторонами a и b
    параметры: 
    (float) a:  ширина прямоугольника 
    (float) b: длина прямоугольника
    возвращаемое значение: периметр прямоугольника
    пример вызова
    >>>perimetr(3,4)
    14
    '''
    return(2(a+b))
