
def area(a):
    '''эта функция принимает a, возвращает значение площади квадрата со стороной a
    параметры: 
    (float) a:     сторона квадрата
    возвращаемое значение: площадь квадрата
    пример вызова
    >>>area(3)
    9    
    '''
    return a * a


def perimeter(a):
    '''эта функция принимает a, возвращает значение периметра квадрата со стороной a
     параметры: 
    (float) a:     сторона квадрата
    возвращаемое значение: перметр квадрата
    пример вызова
    >>>perimetr(3)
    12
    '''
    return 4 * a
