def area(a,h):
    '''эта функция принимает a,h возвращает значение площади прямоугольникка со сторонами a и b
    параметры: 
    (float) a: сторона треугольника 
    (float) h: высота треугольника 
    возвращаемое значение: площадь треугольника
    пример вызова
    >>>area(3,4)
    6
    '''
    return(a*h/2)


def perimetr(a,b,c):
    '''эта функция принимает a,h возвращает значение периметра прямоугольникка со стороной a и высотой h 
    параметры: 
    (float) a: сторона треугольника
    (float) b: вторая сторона треугольника
    (float) c: третья сторона треугольника
    возвращаемое значение: периметр треугольника
    пример вызова
    >>>perimetr(3,4,5)
    12
    '''
    return(a+b+c)
